In [2]:
#Normal python function
def a_name(x):
    return x+x
#Lambda function
x=100
lambda x: x+x

In [3]:
(lambda x: x*2)(12)
###Results
24

24

In [5]:
list_1 = [1,2,3,4,5,6,7,8,9]
cubed = list(map(lambda x: pow(x,3), list_1))
cubed

[1, 8, 27, 64, 125, 216, 343, 512, 729]

In [7]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Luke','Gina','Sam','Emma'],
    'Status': ['Father', 'Mother', 'Son', 'Daughter'],
    'Birthyear': [1976, 1984, 2013, 2016],
})

df

   Name    Status  Birthyear
0  Luke    Father       1976
1  Gina    Mother       1984
2   Sam       Son       2013
3  Emma  Daughter       2016

In [9]:
df['age'] = df['Birthyear'].apply(lambda x: 2021-x)
df

   Name    Status  Birthyear  age
0  Luke    Father       1976   45
1  Gina    Mother       1984   37
2   Sam       Son       2013    8
3  Emma  Daughter       2016    5

In [10]:
list(filter(lambda x: x>18, df['age']))

[45, 37]

In [12]:
df['Gender'] = df['Status'].map(lambda x: 'Male' if x=='Father' or x=='Son' else 'Female')
df

   Name    Status  Birthyear  age  Gender
0  Luke    Father       1976   45    Male
1  Gina    Mother       1984   37  Female
2   Sam       Son       2013    8    Male
3  Emma  Daughter       2016    5  Female

In [15]:
#convert to lower-case
df[['Name','Status']] = df.apply(lambda x: x[['Name','Status']].str.lower(), axis=1)
df

   Name    Status  Birthyear  age  Gender
0  luke    father       1976   45    Male
1  gina    mother       1984   37  Female
2   sam       son       2013    8    Male
3  emma  daughter       2016    5  Female

In [17]:
#Bad, Assigning a name to a Lambda function
triple = lambda x: x*3
#Good
def triple(x):
     return x*3

In [18]:
#Bad Passing functions inside Lambda functions
map(lambda x:abs(x), list_3)
#Good
map(abs, list_3)
#Good
map(lambda x: pow(x, 2), float_nums)

NameError: name 'list_3' is not defined